while True:
    key = input("메뉴\n1. 쓰기\n2. 읽기\n3. 종료\n>> 번호를 고르세요 :  ")

    if key == "1":
        with open("./44.txt", "a+") as f:
            # "a+" (추가+읽기 모드)에선 파일 포인터가 파일의 끝에 위치하기 때문에
            # 이미 내용이 있는 경우, 컨텐츠를 제대로 읽을 수 없음.
            # 이런 문제 해결을 위해서 포인터를 앞에 위치시키기 위한 작업
            f.seek(0)
            content = f.read()
            if content != "":
                print("[이전에 입력한 내용]")
                print(">>>>>>")
                print(content)
                print(">>>>>>")
            print("🎬 글쓰기 시작")
            text = input()
            f.write("\n" + text)
            print("\n✅ 글쓰기 완료")
    elif key == "2":
        with open("./44.txt", "r") as f:
            content = f.read()
            print("[입력한 내용]")
            print(">>>>>>")
            print(content)
            print(">>>>>>")
            print("\n✅ 파일 읽기 완료")
    elif key == "3":
        print("프로그램 종료")
        break
